#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_function.data.external.archive_prepare[0]: Reading...
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=4d8dcb5bc76b080df01faa7097fdf922f4ef8272]
module.lambda_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=44bff5cf9d3bbdc1b23492ed2a878d920b789d7c]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=7477922599744051690]
module.s3_bucket.data.aws_partition.current: Reading...
module.lambda_function.data.aws_region.current: Reading...
aws_apigatewayv2_api.api: Refreshing state... [id=1k08gux1jb]
aws_dynamodb_table.profile: Refreshing state... [id=profile]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.data.aws_caller_identity.current: Reading...
module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/imageGenerator-lambda]
module.lambda_function.data.aws_partition.current: Reading...
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=image-generate]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.s3_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=imageGenerator-lambda]
module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=7797a1854717fed9d22a1133797392ed0b42e6ceee5ae1b18e9fea2879fdd5ae]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/imageGenerator-API]
module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3589367311]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::730335392708:policy/imageGenerator-lambda-logs]
aws_apigatewayv2_stage.apigateway: Refreshing state... [id=$default]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=imageGenerator-lambda-20240404152400024800000001]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=imageGenerator-lambda]
aws_apigatewayv2_integration.lambda["index"]: Refreshing state... [id=hikfcm0]
aws_apigatewayv2_integration.lambda["profile-post"]: Refreshing state... [id=4c3o84v]
aws_apigatewayv2_integration.lambda["profile-get"]: Refreshing state... [id=xsiznv2]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=image-generate]
aws_apigatewayv2_route.lambda["index"]: Refreshing state... [id=w6q0xw4]
aws_apigatewayv2_route.default_route: Refreshing state... [id=jtu7n6n]
aws_apigatewayv2_route.lambda["profile-get"]: Refreshing state... [id=x1d5lkp]
aws_apigatewayv2_route.lambda["profile-post"]: Refreshing state... [id=ydnetyu]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=image-generate,private]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "imageGenerator-lambda"
      ~ last_modified                  = "2024-04-04T17:40:36.000+0000" -> "2024-04-04T17:55:01.884+0000"
        tags                           = {
            "Name" = "terraform-imageGenerator-lambda"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.lambda["index"] must be replaced
-/+ resource "aws_apigatewayv2_integration" "lambda" {
      ~ id                                        = "hikfcm0" -> (known after apply)
      + integration_response_selection_expression = (known after apply)
      ~ integration_type                          = "AWS_PROXY" -> "HTTP_PROXY" # forces replacement
      - request_parameters                        = {} -> null
      - request_templates                         = {} -> null
      ~ timeout_milliseconds                      = 30000 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_apigatewayv2_integration.lambda["profile-get"] must be replaced
-/+ resource "aws_apigatewayv2_integration" "lambda" {
      ~ id                                        = "xsiznv2" -> (known after apply)
      + integration_response_selection_expression = (known after apply)
      ~ integration_type                          = "AWS_PROXY" -> "HTTP_PROXY" # forces replacement
      - request_parameters                        = {} -> null
      - request_templates                         = {} -> null
      ~ timeout_milliseconds                      = 30000 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_apigatewayv2_integration.lambda["profile-post"] must be replaced
-/+ resource "aws_apigatewayv2_integration" "lambda" {
      ~ id                                        = "4c3o84v" -> (known after apply)
      + integration_response_selection_expression = (known after apply)
      ~ integration_type                          = "AWS_PROXY" -> "HTTP_PROXY" # forces replacement
      - request_parameters                        = {} -> null
      - request_templates                         = {} -> null
      ~ timeout_milliseconds                      = 30000 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_apigatewayv2_route.default_route will be updated in-place
  ~ resource "aws_apigatewayv2_route" "default_route" {
        id                   = "jtu7n6n"
      ~ target               = "integrations/hikfcm0" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_apigatewayv2_route.lambda["index"] will be updated in-place
  ~ resource "aws_apigatewayv2_route" "lambda" {
        id                   = "w6q0xw4"
      ~ target               = "integrations/hikfcm0" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_apigatewayv2_route.lambda["profile-get"] will be updated in-place
  ~ resource "aws_apigatewayv2_route" "lambda" {
        id                   = "x1d5lkp"
      ~ target               = "integrations/e47aox5" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_apigatewayv2_route.lambda["profile-post"] will be updated in-place
  ~ resource "aws_apigatewayv2_route" "lambda" {
        id                   = "ydnetyu"
      ~ target               = "integrations/jr0o0ef" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7477922599744051690" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1712252427292768000" -> "1712254139912782000"
            # (1 unchanged element hidden)
        }
    }

Plan: 4 to add, 4 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rauljrtafur, Action: `pull_request`*